{
   "Title":"Mounted Dropbox storage allows \"Dropbox.com\" to access any file",
   "Timestamp": 1435155059,
   "Type":"Blacklist bypass",
   "Risk": 2,
   "CVSS2": {
      "score": 4.6,
      "vector": "AV:N/AC:H/Au:M/C:C/I:N/A:N"
   },
   "CWE": {
      "id": 552,
      "name": "Files or Directories Accessible to External Parties"
   },
   "Affected":[
      {
         "Version":"6.0.8",
         "CVE":"CVE assignment pending",
         "Operator":"<"
      },
      {
         "Version":"7.0.6",
         "CVE":"CVE assignment pending",
         "Operator":"<"
      },
      {
         "Version":"8.0.4",
         "CVE":"CVE assignment pending",
         "Operator":"<"
      }       
   ],
   "Description": "<p>A bug in the SDK used to connect ownCloud against the Dropbox server might allow the owner of \"Dropbox.com\" to gain access to any files on the ownCloud server if an external Dropbox storage was mounted.</p><p>This was caused by a feature of PHP (which has been turned off per default as of PHP 5.6.0) in the handling of POST values sent to the remote host. If a value was prefixed with <code>@</code> the content of the value was replaced with the file name specified after the <code>@</code>.</p><p>Effectively this might allow \"dropbox.com\" to read any files on the server if the following requirements are met:</p><ul><li>Server is running a PHP version below 5.6.0</li><li>An external Dropbox storage has been mounted in ownCloud</li><li>An authenticated user sends a specially crafted request to the mounted storage</li></ul><p>Per default ownCloud does not include any Dropbox mounts.</p>",
   "ActionTaken": "<p>The ownCloud server component is now refusing to handle any files containing a <code>@</code> on the Dropbox external storage. This is no regression as handling files containing said character was not reliably possible before as well.</p><p>The upcoming ownCloud Server 8.1 will contain a new version of the used library to connect to Dropbox which handles files with <code>@</code> correctly.</p>",
   "Acknowledgment":[
      {
         "Name":"Lukas Reschke",
         "Mail":"lukas@owncloud.com",
         "Company":"ownCloud Inc.",
         "Reason":"Vulnerability discovery and disclosure.",
         "HoF": true
      }
   ]
}
